fix:Corrigir falha de inicialização dos monitoradores de downloads
